# Trabalhando com Planilhas do Excel

In [1]:
# Importando a biblioteca
import pandas as pd

In [2]:
# Leitura dos arquivos
df1 = pd.read_excel("datasets/Aracaju.xlsx")
df2 = pd.read_excel("datasets/Fortaleza.xlsx")
df3 = pd.read_excel("datasets/Natal.xlsx")
df4 = pd.read_excel("datasets/Recife.xlsx")
df5 = pd.read_excel("datasets/Salvador.xlsx")

In [3]:
df5.head()

# "Vendas" => valor das vendas

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [4]:
# Agrupando/concatenando todos os dataframes
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
# Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
# Exibindo as últimas 5 linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
# Exibindo 5 linhas aleatórias (amostra aleatória de 5 linhas)
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
151      Natal 2019-01-02   14.63    1035     1
23       Natal 2019-02-14  304.00     854     3
28   Fortaleza 2019-01-01   34.88    1004     3
48     Aracaju 2018-01-01   35.90    1521     8
228   Salvador 2019-01-02    6.87    1037     3

In [8]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
# Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [12]:
# Identificando a existência de valores faltantes (contagem total de valores faltantes)
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
# Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

# "inplace=True" => valor do objeto é modificado em memória

In [14]:
# Calculando a médida total de vendas
df["Vendas"].mean()

122.61180089485438

In [15]:
# Identificando a existência de valores faltantes (contagem total de valores faltantes)
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [16]:
# Visualizando 15 linhas aleatórias (amostra aleatória de 15 linhas)
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
80    Salvador 2019-01-01   40.24   1036     2
164   Salvador 2019-01-02    6.59   1035     1
10   Fortaleza 2019-01-01  179.88   1002     4
25     Aracaju 2018-01-01   34.66   1521     8
177      Natal 2019-01-02   41.19   1037     2
96    Salvador 2019-01-01   42.94   1034     3
30     Aracaju 2018-01-01  119.21   1520     8
20      Recife 2019-01-01   42.35    982     3
52     Aracaju 2018-01-01   14.76   1520     3
13     Aracaju 2018-01-01   43.45   1522    10
121   Salvador 2019-03-02  100.70   1037     3
32   Fortaleza 2019-01-01   43.33   1004     4
54   Fortaleza 2019-01-01   16.73   1002     5
23   Fortaleza 2019-01-01   85.90   1004     5
23      Recife 2019-01-01   37.51    982     2

In [17]:
# Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [18]:
# Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [19]:
# Apagando as linhas com valores nulos com base apenas em 1 coluna (coluna "vendas")
df.dropna(subset=["Vendas"], inplace=True)

In [20]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [21]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [22]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [23]:
# Criando a coluna
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [25]:
# Retornando a maior receita
df["Receita"].max()

3544.0

In [26]:
# Retornando a menor receita
df["Receita"].min()

3.34

In [27]:
# Exibindo as linhas com maiores receiras (nlargest => retorna os top 3 com base na coluna receita)
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [28]:
# Exibindo as linhas com menores receiras (nsamllest => retorna as 3 piores receitas)
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [29]:
# Agrupamento por cidade (soma das receitas por cidade)
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [30]:
# Ordenando o conjunto de dados (pela coluna "receitas")
df.sort_values("Receita", ascending=False).head(10)

# ascending=False => ordem decrescente

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

# **Trabalhando com datas**

In [31]:
# Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [32]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [33]:
# Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [34]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [35]:
# Agrupamento por ano (receita por ano)
df.groupby(df["Data"].dt.year)["Receita"].sum()

# "df["Data"].dt.year" => extrai da docluna "data" apenas o ano

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [36]:
# Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [37]:
# Amostra aleatória
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
25,Salvador,2019-01-01,220.62,1035,1,220.62,1.0,2019
27,Salvador,2019-01-01,145.79,1034,1,145.79,1.0,2019
108,Recife,2019-03-02,152.89,981,4,611.56,4.0,2019
0,Fortaleza,2019-01-01,45.27,1002,2,90.54,2.0,2019
195,Natal,2019-01-02,44.89,1036,3,134.67,3.0,2019

In [38]:
# Extraindo o mês e o dia de venda
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [39]:
# Amostra aleatória
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
18,Salvador,2019-01-01,242.31,1035,1,242.31,1.0,2019,1,1
87,Aracaju,2018-01-01,116.71,1520,4,466.84,4.0,2018,1,1
73,Natal,2018-01-05,773.00,852,2,1546.00,2.0,2018,1,5
161,Salvador,2019-01-02,5.80,1036,1,5.80,1.0,2019,1,2
83,Salvador,2019-01-01,63.66,1036,2,127.32,2.0,2019,1,1

In [40]:
# Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [41]:
# Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [42]:
# Amostra Aleatória
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
52,Aracaju,2018-01-01,14.76,1520,3,44.28,3.0,2018,1,1,0 days
52,Recife,2019-01-01,11.87,981,6,71.22,6.0,2019,1,1,365 days
185,Natal,2019-01-02,6.67,1036,1,6.67,1.0,2019,1,2,366 days
237,Salvador,2019-01-03,38.06,1036,3,114.18,3.0,2019,1,3,367 days
5,Salvador,2019-01-01,179.20,1037,3,537.60,3.0,2019,1,1,365 days

In [43]:
# Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [44]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
101,Natal,2019-01-02,32.28,1035,3,96.84,3.0,2019,1,2,366 days,1
75,Aracaju,2018-01-01,160.64,1523,9,1445.76,9.0,2018,1,1,0 days,1
239,Natal,2019-01-03,161.41,1037,3,484.23,3.0,2019,1,3,367 days,1
81,Recife,2019-01-01,36.52,982,8,292.16,8.0,2019,1,1,365 days,1
43,Aracaju,2018-01-01,19.63,1523,9,176.67,9.0,2018,1,1,0 days,1

In [45]:
# Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [46]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
132,Salvador,2019-03-02,19.61,1036,2,39.22,2.0,2019,3,2,425 days,1
132,Recife,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
109,Salvador,2019-03-02,124.37,1035,1,124.37,1.0,2019,3,2,425 days,1
125,Fortaleza,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
46,Natal,2019-03-26,753.00,853,2,1506.00,2.0,2019,3,26,449 days,1
118,Fortaleza,2019-03-02,17.70,981,5,88.50,5.0,2019,3,2,425 days,1
115,Salvador,2019-03-02,202.33,1035,2,404.66,2.0,2019,3,2,425 days,1
108,Fortaleza,2019-03-02,152.89,981,4,611.56,4.0,2019,3,2,425 days,1
136,Fortaleza,2019-03-02,39.09,982,4,156.36,4.0,2019,3,2,425 days,1
18,Natal,2019-03-14,581.00,853,3,1743.00,3.0,2019,3,14,437 days,1
110,Salvador,2019-03-02,185.93,1036,3,557.79,3.0,2019,3,2,425 days,1
108,Salvador,2019-03-02,11.72,1037,1,11.72,1.0,2019,3,2,425 days,1
50,Natal,2019-03-08,324.00,854,4,1296.00,4.0,2019,3,8,431 days,1
129,Salvador,2019-03-02,125.66,1037,1,125.66,1.0,2019,3,2,425 days,1
117,Salvador,2019-03-02,39.41,1034,1,39.41,1.0,2019,3,2,425 days,1
117,Fortaleza,2019-03-02,15.42,983,8,123.36,8.0,2019,3,2,425 days,1
115,Fortaleza,2019-03-02,12.23,981,3,36.69,3.0,2019,3,2,425 days,1
121,Fortaleza,2019-03-02,41.55,981,3,124.65,3.0,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1
125,Recife,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1